#include "delay.h"
#include "sys.h"
#include "lcd.h"
#include "touch.h"
#include "gui.h"
#include "test.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//测试硬件：单片机STM32F103RBT6,正点原子MiniSTM32开发板,主频72MHZ
//QDtech-TFT液晶驱动 for STM32 IO模拟
//xiao冯@ShenZhen QDtech co.,LTD
//公司网站:www.qdtft.com
//淘宝网站：http://qdtech.taobao.com
//我司提供技术支持，任何技术问题欢迎随时交流学习
//固话(传真) :+86 0755-23594567 
//手机:15989313508（冯工） 
//邮箱:goodtft@126.com 
//Skype:QDtech2008
//技术支持QQ:3002773612
//技术交流QQ群:324828016
//创建日期:2013/5/13
//版本：V2.0
//版权所有，盗版必究。
//Copyright(C) 深圳市全动电子技术有限公司 2013-2019
//All rights reserved
/****************************************************************************************************

//====================================电源接线==========================================//
//VCC        ---接 5V或3.3V电源
//GND        ---接 地

//===============================液晶屏控制线接线======================================//
//CS	       ---接PB11	//液晶屏片选信号
//RESET	     ---接PB12	//液晶屏复位信号
//DC/RS	     ---接PB10	//寄存器/数据选择信号
//SDI(MOSI)	 ---接PB15	//SPI总线写数据
//SCK	       ---接PB13	//SPI总线时钟信号
//LED	       ---接PB9	 //背光控制信号(高电平点亮)如果不需要控制可接VCC常亮
//SDO(MISO)  ---接PB14 //SPI读信号如无需读取可不接

//===============================触摸屏接线========================================//
//不使用触摸或者模块本身不带触摸，则可不连接  
//T_CLK	     ---接PC0	 //触摸SPI总线时钟
//T_CS	     ---接PC13 //触摸IC片选
//T_DIN	     ---接PC3	//触摸SPI总线输入
//T_DO	     ---接PC2	//触摸SPI总线输出
//T_IRQ	     ---接PC1	//触摸屏中断信号

*************************************************************************************************/
int main(void)
{		
	SystemInit();//初始化RCC 设置系统主频为72MHZ
	delay_init(72);	     //延时初始化
	LCD_Init();	   //液晶屏初始化	
	while(1)
	{		
		main_test(); 		//测试主界面
		Test_Color();  		//简单刷屏填充测试
		Test_FillRec();		//GUI矩形绘图测试
		Test_Circle(); 		//GUI画圆测试
		English_Font_test();//英文字体示例测试
		Chinese_Font_test();//中文字体示例测试
		Pic_test();			//图片显示示例测试
		Touch_Test();		//触摸屏手写测试  
	}				  
	
 }

